{
    "_comment": "This is an example config file.",
    "_comment2": "All config files MUST be named '_config.json'.",

    "default-settings/source-folder/": {
        "_comment": "Keys ending with slash or backslash indicate folders. All image files sub-folders in the folder inherit settings defined here.",
        "_comment2": "Configuration for sub-folders and individual files will override these settings.",

        "_comment_ignore": "If ignore is true, every image in this folder is ignored, unless a config file in a subfolder overrides it.",
        "ignore": false,

        "_comment_override": "Relative paths in override determine where images in the config file's directory get saved in the game's graphics folder.",
        "_comment_override2": "If there are paths in override, both include and exclude must not exist or must be empty.",
        "_comment_override3": "All paths listed here must be defined in settings.json.",
        "override": [],

        "_comment_include": "Relative paths in include get added to the paths given in the config files of parent directories.",
        "_comment_include2": "A path cannot exist in both include and exclude.",
        "_comment_include3": "All paths listed here must be defined in settings.json.",
        "include": [],

        "_comment_exclude": "Relative paths in exclude get removed from the paths given in the config files of parent directories.",
        "_comment_exclude2": "All paths listed here must be defined in settings.json.",
        "exclude": [],

        "_comment_crop_anchor": "When cropping an image, this is the centre-point for the cropping, determined as a double between 0.0 and 1.0",
        "_comment_crop_anchor2": "The value 0.0 means that pixels from the bottom or right of the image are cropped, while top or left of the image is preserved.",
        "_comment_crop_anchor3": "The value 1.0 means that pixels from the top or left of the image are cropped, while bottom or right of the image is preserved.",
        "_comment_crop_anchor4": "The value 0.5 means that pixels from the top/left and bottom/right are cropped as equally as possible.",
        "_comment_crop_anchor5": "In most cases you would want to set this individually for each image that you do not want to be centred when cropped.",
        "crop_anchor": 0.5,

        "_comment_folder": "In settings.json, {folder} is a placeholder value which is normally replaced by the name of the folder where the source image is.",
        "_comment_folder2": "Using this, you can override this default behaviour and set the folder name manually.",
        "folder": ""
    },

    "default-settings/source-file": {
        "_comment": "Keys not ending with slash or backslash indicate files. Settings defined here only affect that particular file.",
        "_comment2": "Note that file keys do not have file extensions.",

        "_comment3": "These settings work the same way as in the folder configuration.",
        "ignore": false,
        "override": [],
        "include": [],
        "exclude": [],
        "crop_anchor": 0.5,

        "_comment4": "The settings below only work in file configurations.",

        "_comment_save_as": "Normally the image will be saved with the same name as the source image. This setting can be used to override that behaviour. Do not include the extension.",
        "_comment_save_as2": "Useful if you want to have a different source image for a particular logo size, for example.",
        "save_as": "",

        "_comment_duplicates": "If you want to use the same source logo for multiple teams, list them all here. Do not include the extension.",
        "duplicates": []
    },

    ".": {
        "_comment": "Key with only a dot ('.') indicates that these settings apply to the same folder where the config file is, and its sub-folders.",

        "override": [
			"logos/clubs/huge/{folder}",
			"logos/clubs/large/{folder}",
			"logos/clubs/medium/{folder}",
			"logos/clubs/small/{folder}"
        ],
        "folder": "National Hockey League"
    },

    "example-image": {
        "crop_anchor": 0.2,
        "exclude": [
			"logos/clubs/medium/{folder}"
        ],
        "save_as": "Helsingin Jokerit",
        "duplicates": [
            "Helsingin Jokerit A-Jrs",
            "Helsingin Jokerit B-Jrs"
        ]
    }
}